["Going on [impulse], not thinking about an action before doing it. Often [a tool] of [peer pressure] to make someone do something.", "A banana is a measurement of length. Its use became common around the early twenty-first century, and has continued to remain in common English ever since. The original banana was defined as a curved yellow fruit that was 17 centimeters long; due to the great [famine] and subsequent death of many species, one banana is now nearer to [14.5] centimeters. However, one [ISO] banana is still defined as 17 centimeters despite [the unit] commonly being described as 14.5 centimeters.", "Banana, a subscriber of [Onision] who watches his videos so obsessively they begin to peel their own [skin off] while cannibalizing themselves to the point of death. Most bananas, aka [onision] subscribers Wind up dead or in the hospital due to the cancerous effectiveness videos. Onision must be stopped.", "If your banana tastes really good then you describe it as a \"[banana banana]\"\n\nIt is the way [a banana] should taste.\r\nexample: a banana flavored candy tastes like a banana banana but a regular banana is just a \"banana\", sooo if you have a banana that tastes really really good it is a \"banana banana\". noww if you have an even better one then Its \"banana banana [nana] ana\"", "1. a slang word derived from [the old] saying \"[bananas]\" used to describe someone that was crazy. Used now to describe anything [in style] or cool.", "An asian person who acts like they are white. [Yellow] [on the outside], [white on the inside].", "According to [Gwen Stefani], bananas is what \"this shit\" is. Soon [thereafter] she informs us how to spell bananas. \r\n\r\n[Addicting]? Yes.\r\nRetarted? Perhaps.\r\nGenius? Absolutely.", "[A yellow fruit] that is known to dance and sing about [peanutbutter] and [jelly].", "One of the only words in [the english language] with the [ability] to make you feel stupid every time you try to [write] or type it.", "[A fruit] commonly used in [dick jokes], because it's [shaped] like a FUCKING DICK"]